### Математические операции

In [1]:
# импорт и настройка
# импортирование библиотек
import pandas as pd
import numpy as np
pd.options.display.max_rows = 10
sp500 = pd.read_csv("../../source/sp500_2.csv", 
                    index_col='Symbol',
                    usecols=['Symbol','Sector','Price','BooK Value'])

In [2]:
sp500.head(2)

             Sector   Price  BooK Value
Symbol
MMM     Industrials  222.89       11.34
AOS     Industrials   60.24        6.35

In [3]:
# считываем исторические данные (датафрейм содержит данные об ациях компании mirosoft, apple)

In [4]:
omh = pd.read_csv("../../source/omh.csv",
                  parse_dates=['Date'])
omh.set_index('Date', inplace=True)

In [5]:
omh.head()

             MSFT    AAPL
Date
2014-12-01  48.62  115.07
2014-12-02  48.46  114.63
2014-12-03  48.08  115.93
2014-12-04  48.84  115.49
2014-12-05  48.42  115.00

### Сводка статистик

In [58]:
# вычисляем сводку статистик для отдельного столбца Price (вычисление итоговой статистики для каждого столбца)

In [59]:
sp500.describe()

             Price   BooK Value
count   505.000000   497.000000
mean    103.830634    14.453179
std     134.427636    89.660508
min       2.820000     0.510000
25%      46.250000     2.020000
50%      73.920000     3.400000
75%     116.540000     6.110000
max    1806.060000  1403.380000

|          |Price      | BooK Value | Description                                                           |
|----------|-----------|------------| ----------------------------------------------------------------------|  
| count    |505.000000 |497.000000  | значнея заполненые NoN - не считаются (поэтому разница в значениях )  |
| mean     |103.830634 |14.453179   | среднее значнение                                                     |                 
| std      |134.42763  |89.660508   | стандартное отклонение                                                |
| min      |2.820000   |0.510000    |                                                                       |
| 25%      |46.250000  |2.02000     | 25 - перцентиль                                                       |
| 50%      |73.920000  |3.400000    | 50 - перцентиль                                                       |
| 75%      |116.540000 |6.110000    | 75 - перцентиль                                                       | 
| max      |1806.060000|1403.380000 |                                                                       |

In [7]:
sp500.Price.describe()

count     505.000000
mean      103.830634
std       134.427636
min         2.820000
25%        46.250000
50%        73.920000
75%       116.540000
max      1806.060000
Name: Price, dtype: float64

In [60]:
# получаем сводку статистик для нечисловых данных

|          |                      | Description                           |
|----------|----------------------|---------------------------------------|  
| count    |505                   |                                       |
| unique   |11                    |                                       |       
| top      |Consumer Discretionary| аиболее часто встречающиеся значение  |
| freq     |84                    |сколько раз встречается значение       |                                                                       |

In [67]:
sp500.Sector.describe()

count                        505
unique                        11
top       Consumer Discretionary
freq                          84
Name: Sector, dtype: object

In [10]:
# info - метод (кол-во и тип значений, объем памяти)

In [11]:
sp500.info()

<class 'pandas.core.frame.DataFrame'>
Index: 505 entries, MMM to ZTS
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sector      505 non-null    object
 1   Price       505 non-null    float64
 2   BooK Value  497 non-null    float64
dtypes: float64(2), object(1)
memory usage: 15.8+ KB

In [12]:
# получаем среднюю сводку для нечисловых данных

In [68]:
sp500.Sector.value_counts()

Consumer Discretionary        84
Information Technology        70
Financials                    68
Industrials                   67
Health Care                   61
                              ..
Real Estate                   33
Energy                        32
Utilities                     28
Materials                     25
Telecommunication Services     3
Name: Sector, Length: 11, dtype: int64

In [69]:
# получить долю 
sp500.Sector.value_counts(normalize=True)

Consumer Discretionary        0.166337
Information Technology        0.138614
Financials                    0.134653
Industrials                   0.132673
Health Care                   0.120792
                                ...
Real Estate                   0.065347
Energy                        0.063366
Utilities                     0.055446
Materials                     0.049505
Telecommunication Services    0.005941
Name: Sector, Length: 11, dtype: float64

### Арифметические операции

- задаем стартовое значение генератора случайных чисел для получения воспроизводимых результатов
- созадем объект DataFrame

In [14]:
np.random.seed(123)
df = pd.DataFrame(np.random.randn(5, 4),
                  columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -1.085631  0.997345  0.282978 -1.506295
1 -0.578600  1.651437 -2.426679 -0.428913
2  1.265936 -0.866740 -0.678886 -0.094709
3  1.491390 -0.638902 -0.443982 -0.434351
4  2.205930  2.186786  1.004054  0.386186

In [15]:
# умножаем все на 2, берем абсолютные значения
# получается новый датаферйм (исходный остается неизменным)

In [16]:
abs(df*2)

          A         B         C         D
0  2.171261  1.994691  0.565957  3.012589
1  1.157201  3.302873  4.853358  0.857825
2  2.531873  1.733481  1.357772  0.189418
3  2.982779  1.277804  0.887964  0.868703
4  4.411860  4.373572  2.008108  0.772373

In [70]:
# При выполнении операции над DataFrame и Series 
# происходит выравниеваение Series по столбцам DataFrame

In [ ]:
# вычитание первой строки из каждой строки объекта DataFrame

In [18]:
df

          A         B         C         D
0 -1.085631  0.997345  0.282978 -1.506295
1 -0.578600  1.651437 -2.426679 -0.428913
2  1.265936 -0.866740 -0.678886 -0.094709
3  1.491390 -0.638902 -0.443982 -0.434351
4  2.205930  2.186786  1.004054  0.386186

In [19]:
df.iloc[0]

A   -1.085631
B    0.997345
C    0.282978
D   -1.506295
Name: 0, dtype: float64

In [20]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.507030  0.654091 -2.709658  1.077382
2  2.351567 -1.864086 -0.961865  1.411586
3  2.577020 -1.636247 -0.726960  1.071943
4  3.291561  1.189441  0.721075  1.892481

In [21]:
# вычитаем объект DataFrame из Series

In [22]:
df.iloc[0] - df

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.507030 -0.654091  2.709658 -1.077382
2 -2.351567  1.864086  0.961865 -1.411586
3 -2.577020  1.636247  0.726960 -1.071943
4 -3.291561 -1.189441 -0.721075 -1.892481

- возьмем второе и третье поле 1-ой строки:
- добавляем столбец Е
- смотрим, как применяется выравнивание в этой математической операции

In [23]:
df

          A         B         C         D
0 -1.085631  0.997345  0.282978 -1.506295
1 -0.578600  1.651437 -2.426679 -0.428913
2  1.265936 -0.866740 -0.678886 -0.094709
3  1.491390 -0.638902 -0.443982 -0.434351
4  2.205930  2.186786  1.004054  0.386186

In [71]:
# создаем обект Series на основе 1 строки DataFrame В С + добавеляем Е
s = df.iloc[0][1:3]
s['E'] = 0
s

B    0.997345
C    0.282978
E    0.000000
Name: 0, dtype: float64

In [ ]:
# выравниеваение Series по столбцам DataFrame

In [25]:
df + s

    A         B         C   D   E
0 NaN  1.994691  0.565957 NaN NaN
1 NaN  2.648782 -2.143701 NaN NaN
2 NaN  0.130605 -0.395908 NaN NaN
3 NaN  0.358443 -0.161003 NaN NaN
4 NaN  3.184132  1.287032 NaN NaN

In [26]:
# извлекаем строки в позициях с 1-й по 3-ю и только столбцы В и С
# по сути - извлекаем небольшой квадрат из середины df

In [27]:
subframe = df[1:4][['B', 'C']].copy()
subframe

          B         C
1  1.651437 -2.426679
2 -0.866740 -0.678886
3 -0.638902 -0.443982

In [28]:
# как происходит выравнивание при выполнении операции вычитания

In [29]:
df - subframe

    A    B    C   D
0 NaN  NaN  NaN NaN
1 NaN  0.0  0.0 NaN
2 NaN  0.0  0.0 NaN
3 NaN  0.0  0.0 NaN
4 NaN  NaN  NaN NaN

In [30]:
# извлекаем столбец А и вычитаем его из нашего датафрейма
df

          A         B         C         D
0 -1.085631  0.997345  0.282978 -1.506295
1 -0.578600  1.651437 -2.426679 -0.428913
2  1.265936 -0.866740 -0.678886 -0.094709
3  1.491390 -0.638902 -0.443982 -0.434351
4  2.205930  2.186786  1.004054  0.386186

In [31]:
df.sub(df['A'], axis =0)

     A         B         C         D
0  0.0  2.082976  1.368609 -0.420664
1  0.0  2.230037 -1.848079  0.149688
2  0.0 -2.132677 -1.944822 -1.360645
3  0.0 -2.130292 -1.935372 -1.925741
4  0.0 -0.019144 -1.201876 -1.819744

### Одномерные статистики

In [32]:
# минимум / максимум
# определяем максимальную цену для обеих акций

In [33]:
omh[['MSFT','AAPL']].min()

MSFT     45.16
AAPL    106.75
dtype: float64

In [34]:
# определим индекс, которому соответсвует максимальная цена для обеих акций

In [35]:
omh[['MSFT','AAPL']].idxmin()

MSFT   2014-12-16
AAPL   2014-12-16
dtype: datetime64[ns]

In [36]:
# среднее значение / медиана / мода

<image
    src='../../source/1.png'
    alt="среднее значение / медиана / мода">

![среднее значение / медиана / мода](../../source/1.png)

In [37]:
# вычисление среднего значения mean() для всех столбцов в датафрейме omh

In [38]:
omh.mean()

MSFT     47.493182
AAPL    112.411364
dtype: float64

In [39]:
# вычисление значения, усредненного по всем столбцам, для каждой строки (выводим только первые 5)

In [40]:
omh.mean(axis = 1).head()

Date
2014-12-01    81.845
2014-12-02    81.545
2014-12-03    82.005
2014-12-04    82.165
2014-12-05    81.710
dtype: float64

In [41]:
# вычисляем медиану значений для каждолго столбца

In [42]:
omh.median()

MSFT     47.625
AAPL    112.530
dtype: float64

In [43]:
# вычисляем моду для столбца Sector (мода - самое часто встречающееся значение в серии) 
# возвращает не скалярное значение а серию, тк мод может быть несколько

In [44]:
sp500.Sector.mode()

0    Consumer Discretionary
dtype: object

In [45]:
# мод может быть несколько, пэтому результат операции - Series

In [46]:
s = pd.Series([1, 2, 3, 3, 5, 1])
s.mode()

0    1
1    3
dtype: int64

### дисперсия / среднеквадратичное отклонение

In [47]:
# вычисляем дисперсию значений в каждом столбце
# дисперсия - насколько сильно значение отличается от среднего

In [48]:
omh.var()

MSFT    0.870632
AAPL    5.706231
dtype: float64

In [ ]:
# вычислеине дисперсии по формуле напрямую

In [49]:
(omh.MSFT**2 - omh.MSFT.mean()**2).sum() / (omh.shape[0]-1)

0.8706322510824867

In [50]:
# вычисление среднеквадратичного отклонения

In [51]:
omh.std()

MSFT    0.933077
AAPL    2.388772
dtype: float64

In [ ]:
# вычислеине по формуле напрямую

In [52]:
omh.MSFT.var()**0.5

0.9330767659106356

###  ковариация / корреляция

In [ ]:
# ковариация и кореляция - это взаимосвязь между двумя переменными
# ковариация - показвает как взаимосязанны переменные (положительно или отрицательно), но не дает понминия о силе взаимосвязи
# кореляция - сила взаимосвязи между переменными принимает значение от -1 до 1
# -1 - идеальная отрицательня взаимосязь, 0 нет взаимосвязи, 1 - деальная положительная взаимосязь

In [53]:
# вычисляем ковариацию между MSFT и AAPL

In [54]:
omh.MSFT.cov(omh.AAPL)

1.9261240259740264

In [ ]:
# 1.9261240259740264 прямая зависимоть, тк положительное число (те при росте акции MSFT растер и акция AAPL )

In [55]:
omh.MSFT.cov(omh.AAPL) / (omh.MSFT.std() * omh.AAPL.std())

0.8641560684381169

In [56]:
# либо можем получать матрицу ковариаций

In [57]:
omh.corr()

          MSFT      AAPL
MSFT  1.000000  0.864156
AAPL  0.864156  1.000000

### Преобразование данных

### дискретизация и квантилизация

In [ ]:
# дискретизация  - способ разбиение нерперывных данных на группы (бины bins )

In [77]:
# генерируем 10000 случайных чисел из стандартного нормального распределения

In [78]:
np.random.seed(123456)
dist = np.random.normal(size = 10000)
dist

array([ 0.4691123 , -0.28286334, -1.5090585 , ...,  0.26296448,
       -0.83377412, -0.10418135])

In [79]:
# выводим среднее и стандарное отклонение 
# тк случайные числа взяты из нормального распределения то ожидается, что по мере увеличения выборки
# среднее будет приближаться к 0
# стандарное отклонеине приближаться к 1

In [80]:
(dist.mean(), dist.std())

(-0.002863324040906651, 1.008716203199891)

In [81]:
# разбиваем на 5 одинаковых по размеру групп (по размеру интевалов - не количесву наблюдений в группе)

In [83]:
bins = pd.cut(dist, 5)
bins

[(-0.633, 0.81], (-0.633, 0.81], (-2.077, -0.633], (-2.077, -0.633], (0.81, 2.254], ..., (-2.077, -0.633], (-0.633, 0.81], (-0.633, 0.81], (-2.077, -0.633], (-0.633, 0.81]]
Length: 10000
Categories (5, interval[float64, right]): [(-3.528, -2.077] < (-2.077, -0.633] < (-0.633, 0.81] < (0.81, 2.254] < (2.254, 3.698]]

In [85]:
# найдем дляны соответсвующих интервалов

In [86]:
bins.categories

IntervalIndex([(-3.528, -2.077], (-2.077, -0.633], (-0.633, 0.81], (0.81, 2.254], (2.254, 3.698]], dtype='interval[float64, right]')

In [87]:
# вычисляем размеры интервалов
[q.right - q.left for q in bins.categories]

[1.451, 1.444, 1.443, 1.444, 1.444]

In [88]:
# генерируем 50 значений возраста в диапазоне от 6 до 70
# ages = np.random.randint(6, 70, 50) - в выборке 50 челове от 6 до 70 лет

In [90]:
np.random.seed(242)
ages = np.random.randint(6, 70, 50)
ages

array([20, 45,  8, 28, 53,  7, 12, 19, 66, 42, 10, 37, 34, 25, 44, 69, 34,
       67, 25, 51,  8, 50, 33, 42, 20, 31, 64, 51, 59, 11, 40, 32, 33, 29,
       28, 18, 16, 47, 45, 66, 43, 65, 16, 17, 69,  9, 19, 42, 33, 39])

In [91]:
# добавляем имена для групп

In [94]:
ranges = [6, 12, 18, 35, 50, 70]
labels = ['Youth', 'Youth Adult', 'Adult', 'Middle Aged', 'Retired person']
agebins = pd.cut(ages, ranges, labels=labels)
agebins.describe()

                counts  freqs
categories
Youth                7   0.14
Youth Adult          4   0.08
Adult               16   0.32
Middle Aged         12   0.24
Retired person      11   0.22

In [95]:
# разбиваем (используя квантили) на 5 групп с одинаковым количеством элементов

In [96]:
qbin = pd.qcut(dist, 5)

In [97]:
# найдем статистику по полученным группам categories

In [98]:
qbin.describe()

                  counts  freqs
categories
(-3.522, -0.861]    2000    0.2
(-0.861, -0.241]    2000    0.2
(-0.241, 0.261]     2000    0.2
(0.261, 0.866]      2000    0.2
(0.866, 3.698]      2000    0.2

In [99]:
# пример использования qcut
# разобъем данные из sp500_copy на 5 групп (группы в зависимости от стоимости акций диапазон array )

In [100]:
sp500_copy = sp500.copy()

In [101]:
sp500_copy['Price_Group'], bins = pd.qcut(sp500_copy.Price,
                                          5,
                                          labels=['group_'+str(i) for i in range(1, 6)],
                                          retbins=True)
sp500_copy.Price_Group

Symbol
MMM     group_5
AOS     group_2
ABT     group_2
ABBV    group_4
ACN     group_5
         ...
XYL     group_3
YUM     group_3
ZBH     group_4
ZION    group_2
ZTS     group_3
Name: Price_Group, Length: 505, dtype: category
Categories (5, object): ['group_1' < 'group_2' < 'group_3' < 'group_4' < 'group_5']

In [102]:
bins

array([   2.82 ,   40.57 ,   62.638,   90.774,  140.848, 1806.06 ])

In [103]:
sp500_copy.Price_Group.value_counts()

group_1    101
group_2    101
group_3    101
group_4    101
group_5    101
Name: Price_Group, dtype: int64

### куммулятивные суммы

In [104]:
# вычисляем куммулятивную сумму

In [105]:
pd.Series([1, 2, 3, 4]).cumsum()
# 1 строка 1+2
# 2 строка 1+2+3
# 3 строка 1+2+3+4

0     1
1     3
2     6
3    10
dtype: int64

In [106]:
# вычисляем куммулятивное произведение

In [107]:
pd.Series([1, 2, 3, 4]).cumprod()

0     1
1     2
2     6
3    24
dtype: int64

### ранжирование

In [108]:
# для примера

In [112]:
s = pd.Series([160, 165, 165, 170, 175], index=list('abcde'))
s

a    160
b    165
c    165
d    170
e    175
dtype: int64

In [113]:
# ранжируем значения

In [114]:
s.rank()

a    1.0
b    2.5
c    2.5
d    4.0
e    5.0
dtype: float64

### относительное изменение

In [116]:
omh[['MSFT']].head()

             MSFT
Date
2014-12-01  48.62
2014-12-02  48.46
2014-12-03  48.08
2014-12-04  48.84
2014-12-05  48.42

In [117]:
# вычисляем относительное изменине для MSFT (текущее значение с предыдущем)

In [118]:
omh[['MSFT']].pct_change().head()

                MSFT
Date
2014-12-01       NaN
2014-12-02 -0.003291
2014-12-03 -0.007842
2014-12-04  0.015807
2014-12-05 -0.008600

In [119]:
# как получилось первое значение
(48.46 - 48.62)/48.62

-0.003290826820238515

### оконные функции

In [120]:
# объект Rolling - создание скользящего окна 
# скользящее окно позволяет пересчитывать статистику для каждого окна
# r = omh.MSFT.rolling(3) - задание скользящего окна в 3 значения

In [121]:
r = omh.MSFT.rolling(3)

In [122]:
# возможные операции

In [126]:
r

Rolling [window=3,center=False,axis=0,method=single]

In [124]:
# скользящее среднее

In [127]:
r.mean()

Date
2014-12-01          NaN
2014-12-02          NaN
2014-12-03    48.386667
2014-12-04    48.460000
2014-12-05    48.446667
                ...
2014-12-24    48.190000
2014-12-26    48.156667
2014-12-29    47.823333
2014-12-30    47.450000
2014-12-31    46.973333
Name: MSFT, Length: 22, dtype: float64

In [128]:
# первое значение (среднее значнеие первых трех )

In [130]:
omh.MSFT.loc['2014-12-01':'2014-12-03'].mean()

48.38666666666666

In [129]:
# второе значение (скользящее окно перемещается на 1 интервал вдоль данных)

In [131]:
omh.MSFT.loc['2014-12-02':'2014-12-04'].mean()

48.46